Revit 2027 API
ZoomFitType Enumeration
 This enum is used to define type of zoom.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ZoomFitType
Public Enumeration ZoomFitType
public enum class ZoomFitType
type ZoomFitType
Members
Member name | Value | Description
FitToPage | 0 |  Fit the whole view into a specific image size.
Zoom | 1 |  Calculate the size of the image using physical size of the view, zoom value and resolution.
See Also
Reference
Autodesk.Revit.DB Namespace